{
  "full_name": "MEHRAN SADEGHI",
  "profession": "Front-end Developer",
  "social_networks": {
    "linkedin": "https://www.linkedin.com/in/mehran-sadeghi",
    "github": "https://github.com/mehran79sadeghi2"
  },
  "show_avatar": true,
  "description": "I'm a Web Developer, currently working as Front-end Developer at Karnameh, an online platform for buying and selling cars (backed by Divar). I have around 3 years of experience in software development. My aim is to enhance user experience and create new values in addition to delivering a clean scalable code, by being closely in touch with the end-users.",
  "resume_link": "https://drive.google.com/file/d/1eygay2_quPS4Jja3QNkDt73ixGKyUVr1/view",
  "experiences": [
    {
      "company": "Karnameh",
      "date": "Aug 2022 - Present",
      "profession": "Front-end Developer",
      "description": "Karnameh is one of the services of Divar with the aim of creating a better user experience in buying and selling cars and as a complementary service of Divar in the field of cars. This service intends to become a reliable assistant for Iranians in buying and selling cars and create a superior experience in buying and selling cars for you with services such as on-site car expertise and customized car sales."
    },
    {
      "company": "SnappCarFix / CarFillo",
      "date": "Oct 2021 - Aug 2022 · 11 mos",
      "profession": "Front-end Developer",
      "description": "SnappCarFix is an online platform for Car parts and services, backed by Snapp (Uber clone). It includes web apps for Stores, ServiceCenters, Agents, and Sellers, to offer products/services like oil, battery, engine parts, car wash, etc, with 7 delivery/service solutions per product.",
      "bullets": [
        "Lead front-end developer because of advocating best development practices and writing high-performance, reusable code in 3 Web Applications",
        "Refactoring more than 80% of codes of all 3 projects with upgraded UI/UX and optimizing theme in order to responsive web design concepts",
        "Design a clean architecture for CSS based on styled components, CSS modules, and bootstrap",
        "Getting fluency in Map tools like Mapbox-gl and implementing them in projects",
        "Contributed to projects within Scrum project management environments."
      ]
    },
    {
      "company": "ViraMadar Pishran",
      "date": "Aug 2020 - Oct 2021 · 1 yr 3 mos",
      "profession": "Front-end Developer",
      "description": "ViraMdar Pishran is a start-up company in the field of application and web design, which started its activity in the field of internet business in 2018.",
      "bullets": [
        "Responsible for implementing high-level graphical components with the combination of SVG and CSS in 3 projects",
        "Followed SDLC best practices within Agile Methodologies",
        "Implementing my own npm package for React.js and using it in 2 projects of the company",
        "Design architecture of SSR and CSR projects and adapt the team to it",
        "More than 50% increase in the speed of SRR projects with tools like lazy loading",
        "Improved tools to boost user interaction and deliver design versatility",
        "Responsible to manage repositories of 5 projects in git"
      ]
    },
    {
      "company": "Jambod",
      "date": "Jul 2019 - Oct 2019 · 4 mos",
      "profession": "Android Intern",
      "description": "Recycling management application with an uber like functionality.",
      "bullets": [
        "Developed real-time location tracking of drivers.",
        "Decreased latency by using a push-based system instead of an older pull based one"
      ]
    }
  ],
  "educations": [
    {
      "academy": "Lorestan University, Iran",
      "date": "Bachelor's degree",
      "major": "Software Engineering"
    }
  ],
  "colors": {
    "text-1": "#333",
    "text-2": "#666",
    "text-3": "#aaa",
    "primary": "#54ca95",
    "primary-hover": "#4ec08d",
    "background-color-1": "white",
    "background-color-2": "white",
    "background-color-3": "rgb(245, 255, 251)",
    "scroll-bar": "#cacaca",
    "scroll-bar-hover": "#b4b4b4"
  }
}
